hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/sf_rf_6lowpan.c

/**
 * @code
 *  ___ _____ _   ___ _  _____ ___  ___  ___ ___
 * / __|_   _/_\ / __| |/ / __/ _ \| _ \/ __| __|
 * \__ \ | |/ _ \ (__| ' <| _| (_) |   / (__| _|
 * |___/ |_/_/ \_\___|_|\_\_| \___/|_|_\\___|___|
 * embedded.connectivity.solutions.==============
 * @endcode
 *
 * @file       sf_rf_6lowpan.c
 * @copyright  STACKFORCE GmbH, Heitersheim, Germany, http://www.stackforce.de
 * @author     STACKFORCE
 * @brief      Implementation of the 6lowpan rf interface.
 */
#ifdef __cplusplus
extern "C" {
#endif

#define __DECL_SF_RF_6LOWPAN_H__
#define __DECL_SF_RF_6LOWPAN_H__

/*==============================================================================
                            INCLUDE FILES
==============================================================================*/
#include "emb6.h"
#include "target_conf.h"

/* Stack specific include */
#include "rt_tmr.h"
#include "packetbuf.h"
#include "evproc.h"

#define  LOGGER_ENABLE        LOGGER_RADIO
#include "logger.h"

#include "cc13xx_cfg.h"
#include "sf_rf_6lowpan.h"
#include "bsp/ti_cc13xx/board_conf.h"
/* Standart libraries */
#include <stdint.h>
#include <stdbool.h>
#include "rflib/rf_dbell.h"
#include "driverlib/rf_mailbox.h"
#include "bsp.h"
#include "framer_802154_ll.h"

#if USE_TI_RTOS
#include <ti/drivers/rf/RF.h>
#include <driverlib/rf_common_cmd.h>
#include <driverlib/rf_mailbox.h>
#include <driverlib/rf_prop_cmd.h>
#include <driverlib/rf_prop_mailbox.h>
#include <xdc/runtime/Error.h>
#include <rf_patches/rf_patch_cpe_genfsk.h>
#include <rf_patches/rf_patch_rfe_genfsk.h>
#include "emb6_semaphore.h"
#include "sf_mcu_sleep.h"
#else
/* BoardSupportPacket */
#include "bsp/srf06eb_cc26xx/drivers/source/bsp.h"
#endif
/*==============================================================================
                            DEFINES
==============================================================================*/
#ifndef CC13XX_TX_ENABLED
#error Please define if the device support TX
#endif /* CC13XX_TX_ENABLED */

#ifndef CC13XX_RX_ENABLED
#error Please define if the device support RTX
#endif /* CC13XX_RX_ENABLED */

#ifndef CC13XX_MAX_TELEGRAM_LEN
#error Please define the maximum length needed to send or receive one telegram
#endif /* CC13XX_MAX_TELEGRAM_LEN */


/*==============================================================================
                            VARIABLES
==============================================================================*/
static s_ns_t *ps_rf_netstk;

st_cc1310_t cc1310;
uint8_t RxBuff[RX_BUFF_SIZE];
framer802154ll_attr_t frame;
uint8_t ack[10];
uint8_t ack_length;


/* Threshold value for the rx process. */
#define RF_RX_THRESHOLD        0x05U

/* Defines the default TX-power of the device: Here 0dBm is used */
#define RF_DEFAULT_TX_POWER    130U


/*==============================================================================
                            FUNCTION PROTOTYPES
==============================================================================*/

static bool rf_driver_init(void);
static uint8_t sf_rf_switchState(e_rf_status_t state);
static e_rf_status_t sf_rf_get_Status(void);
static uint8_t sf_rf_getRssi(void);
static uint8_t sf_rf_init_tx(uint8_t *pc_data, uint16_t  i_len);
static uint8_t* sf_rf_get_p_lastPkt(void);
static uint16_t sf_rf_get_LenLastPkt(void);
static bool sf_rf_set_numOfRssiMeas(uint8_t num);
static bool sf_rf_update_run_frequency(uint16_t frequency, uint16_t fractFreq);
static bool sf_rf_update_frequency(uint16_t frequency, uint16_t fractFreq);
static void rx_call_back(uint32_t l_flag);

static void sf_rf_init_cca_cmd(void);
#if USE_TI_RTOS
static void Rtos_callback(RF_Handle h, RF_CmdHandle ch, RF_EventMask e);
#else
static void loc_switchToHfXtalOsc(void);
#endif


/*==============================================================================
                           API FUNCTIONS
==============================================================================*/

void cc13xx_eventHandler(c_event_t c_event, p_data_t p_data)
{
  /* set the error code to default */
  e_nsErr_t err = NETSTK_ERR_NONE;

  /* check if it is the right event */
  if(c_event == NETSTK_RF_EVENT )
  {
    ps_rf_netstk->phy->recv(sf_rf_get_p_lastPkt(), sf_rf_get_LenLastPkt(), &err);
  }
}


bool sf_rf_6lowpan_init(void *p_netstk)
{
  /* store pointer to global netstack structure */
  ps_rf_netstk = (s_ns_t *)p_netstk;

  /* call the routine with init state to initialize the driver */
  if(sf_rf_switchState(RF_STATUS_INIT) != ROUTINE_DONE )
    return false;
  if(sf_rf_switchState(RF_STATUS_RX_LISTEN)!= ROUTINE_DONE)
    return false;
  /* initialize local variables */
  RF_SEM_WAIT(NETSTK_RF_EVENT);

  return true;
}


uint8_t sf_rf_6lowpan_sendBlocking(uint8_t *pc_data, uint16_t  i_len)
{
    uint8_t status;
  /* check if transceiver is not is sleepy mode */
  if( sf_rf_get_Status() == RF_STATUS_SLEEP )
    return 0;
  /* init tx cmd */
  if (!sf_rf_init_tx(pc_data,i_len))
  {
    bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
    return 0;
  }
  /* call the routine with tx state to send the packet*/
  status = sf_rf_switchState(RF_STATUS_TX);
  if(status != ROUTINE_DONE && status != ROUTINE_ERROR_TX_NOACK )
  {
      bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
      return 0;
  }
  else
  {
        #if CC13XX_TX_LED_ENABLED
          bsp_led( HAL_LED2, EN_BSP_LED_OP_BLINK );
        #endif
        /* Set the transceiver in rx mode */
          sf_rf_switchState(RF_STATUS_RX_LISTEN);
        if(status== ROUTINE_DONE)
            return 1;
        else
            return 2;
  }
}


void sf_rf_6lowpan_sleep(void)
{
    /* check if the radio is already in sleep mode */
    if( sf_rf_get_Status() == RF_STATUS_SLEEP )
        return;
    /* Turn OFF radio core and disable interrupt */
    sf_rf_switchState(RF_STATUS_SLEEP);
}


bool sf_rf_wake(void) //  called by the radio : cc13xx_On (e_nsErr_t *p_err)
{
  /* Init the driver */
  if(sf_rf_switchState(RF_STATUS_INIT)!= ROUTINE_DONE)
        return false;
  /* Turn radio to RX mode */
  if(sf_rf_switchState(RF_STATUS_RX_LISTEN)!= ROUTINE_DONE)
      return false;

