hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/sf_rf_6lowpan.c
  return true;
}


uint8_t sf_rf_6lowpan_getTxPower(void)
{
    return cc1310.tx.signalStrength;
}


bool sf_rf_6lowpan_setTxPower(uint8_t c_txPower)
{
    bool b_return = true;
    /** Command for setting the tx power */
    rfc_CMD_SET_TX_POWER_t s_cmdTxPower;
    s_cmdTxPower.commandNo = CMD_SET_TX_POWER;

    /* check if the radio is in sleepy mode */
    if( sf_rf_get_Status() == RF_STATUS_SLEEP)
        return false;
    /* Values from smart rf studio v2.1.0 */
    /* Set the minimum */
    if(c_txPower <= 124U) /* -10dbm */
    {
//      s_cmdTxPower.txPower.IB =        0x00U;
 //     s_cmdTxPower.txPower.GC =        0x03U;
//      s_cmdTxPower.txPower.boost =     0x00U;
 //     s_cmdTxPower.txPower.tempCoeff = 0x00U;
      cc1310.tx.signalStrength = 120U;
    }
    /* Set the maximum */
    else if(c_txPower >= 144) /*  14dbm */
    {
//      s_cmdTxPower.txPower.IB =        0x3FU;
//      s_cmdTxPower.txPower.GC =        0x00U;
//      s_cmdTxPower.txPower.boost =     0x01U;
//      s_cmdTxPower.txPower.tempCoeff = 0x00U;
      cc1310.tx.signalStrength = 144U;
    }
    /* Calculate the register settings */
    else
    {
      /* Check which setting should be used. */
      switch(c_txPower)
      {
      case 143U:                                                     /* 13dBm */
//        s_cmdTxPower.txPower.IB =        0x3FU;
//        s_cmdTxPower.txPower.GC =        0x00U;
//        s_cmdTxPower.txPower.boost =     0x00U;
//        s_cmdTxPower.txPower.tempCoeff = 0x00U;
        break;

      case 142U:                                                     /* 12dBm */
//        s_cmdTxPower.txPower.IB =        0x14U;
//        s_cmdTxPower.txPower.GC =        0x00U;
//        s_cmdTxPower.txPower.boost =     0x00U;
//        s_cmdTxPower.txPower.tempCoeff = 0x00U;
        break;

      case 141U: case 140U: case 139U: case 138U:                    /* 10dBm */
//        s_cmdTxPower.txPower.IB =        0x11U;
 //       s_cmdTxPower.txPower.GC =        0x03U;
//        s_cmdTxPower.txPower.boost =     0x00U;
//        s_cmdTxPower.txPower.tempCoeff = 0x00U;
        break;

      case 137U: case 136U: case 135U: case 134U: case 133U:         /*  5dBm */
 //       s_cmdTxPower.txPower.IB =        0x05U;
//        s_cmdTxPower.txPower.GC =        0x03U;
//        s_cmdTxPower.txPower.boost =     0x00U;
//        s_cmdTxPower.txPower.tempCoeff = 0x00U;
        break;

      case 132U: case 131U: case 130U: case 129U: case 128U: case 127U:
      case 126U: case 125U:                                          /*  0dBm */
//        s_cmdTxPower.txPower.IB =        0x02U;
//        s_cmdTxPower.txPower.GC =        0x03U;
//        s_cmdTxPower.txPower.boost =     0x00U;
//        s_cmdTxPower.txPower.tempCoeff = 0x00U;
        break;
      }
      cc1310.tx.signalStrength = c_txPower;
    }
#if !USE_TI_RTOS
      /* Transmit the tx power setting to the rf-core */
      MB_SendCommand((uint32_t) &s_cmdTxPower);
#endif
    return b_return;
}


uint8_t sf_rf_6lowpan_getRssi(void)
{
  return sf_rf_getRssi();
}


E_RF_CCA_RESULT_t sf_rf_6lowpan_cca(uint8_t c_numOfRssiMeas)
{
  E_RF_CCA_RESULT_t e_return;
  uint8_t returnValue;

  if( sf_rf_get_Status() == RF_STATUS_SLEEP )
      return E_RF_CCA_RESULT_INVALID_RF_STATE;
  /* set number of RSSI measurement */
  sf_rf_set_numOfRssiMeas(c_numOfRssiMeas);
  returnValue=sf_rf_switchState(RF_STATUS_CCA);
  if(returnValue == ROUTINE_CCA_RESULT_IDLE)
    e_return = E_RF_CCA_RESULT_IDLE;
  else if (returnValue == ROUTINE_CCA_RESULT_BUSY )
    e_return = E_RF_CCA_RESULT_BUSY;
  else
    e_return = E_RF_CCA_RESULT_INVALID_RF_STATE;
  /* Set the transceiver in RX mode */
  sf_rf_switchState(RF_STATUS_RX_LISTEN);
  return e_return;
}


 bool sf_rf_6lowpan_chanNumSet(uint8_t chan_num)
{
  uint8_t retVal;
  uint16_t Cent_freq;
  uint16_t Frac_Freq;
  uint16_t Delta;
  uint8_t OpMode=1;
  /* verify if the channel is supported */
  if(chan_num > 33)
      return false;
  /* check the operation mode */
  switch(OpMode)
  {
  case 1 :
    Cent_freq=0x035F;
    Frac_Freq=0x2000;
    Delta=0x3333;
    /* calculate the frequency parameters for desired channel */
    Cent_freq = Cent_freq + (chan_num / 5);
    Frac_Freq = Frac_Freq + (chan_num % 5) * Delta;
    break;
  default:
    return false;
  }
  /* check if the radio is in sleepy mode */
  if( (sf_rf_get_Status()== RF_STATUS_SLEEP))
  {
    /* update frequency without running command: it will be executed when the radio wake up */
    if(sf_rf_update_frequency(Cent_freq, Frac_Freq))
      return true;
    else
      return false;
  }
  /* check if the radio is in RX mode */
  if( (sf_rf_get_Status()== RF_STATUS_RX_LISTEN) )
  {
      /* update frequency */
      if(sf_rf_update_run_frequency(Cent_freq, Frac_Freq))
        retVal= true;
      else
        retVal= false;
      /* Set the transceiver in RX mode */
      sf_rf_switchState(RF_STATUS_RX_LISTEN);
  }
  else
      retVal= false;
return retVal;
}



/*==============================================================================
                             FUNCTION
==============================================================================*/

 /* TI RTOS variables */
 #if USE_TI_RTOS
 /* RF parameter struct */
 static RF_Params gs_rfParams;
 static RF_Object gs_rfObject;
 static RF_Handle gps_rfHandle;
 static RF_CmdHandle gps_rf_cmdHandle;
 /* TI-RTOS RF Mode Object */
 RF_Mode RF_prop =
 {
     .rfMode = RF_MODE_PROPRIETARY_SUB_1,
     .cpePatchFxn = &rf_patch_cpe_genfsk,
     .mcePatchFxn = 0,
     .rfePatchFxn = &rf_patch_rfe_genfsk,
 };

#define RF_RTOS_EVENT_MASK    ( RF_EventLastCmdDone | RF_EventRxOk | \
		RF_EventRxNOk | \
		RF_EventInternalError | \
		RF_EventRxBufFull | RF_EventRxIgnored | RF_EventRxAborted )

#endif /* USE_TI_RTOS */


static bool rf_driver_init(void)
{
#if USE_TI_RTOS

  RF_Params_init(&gs_rfParams);
  if(gps_rfHandle == NULL)
    gps_rfHandle = RF_open(&gs_rfObject, &RF_prop, (RF_RadioSetup*) &RF_802_15_4_cmdPropRadioDivSetup , &gs_rfParams);
  if(gps_rfHandle != NULL)
    return true;
  else
	return false;

#else
  rfc_returnValue_t returnValue;

  returnValue = RFC_selectRadioMode(RFC_GFSK);
  if(returnValue == RFC_OK)
  {
    /* 1.2. Enable RF Core */
    returnValue = RFC_enableRadio();
    if(returnValue == RFC_OK)
    {
      /* 1.3. Switch to HF XTAL. Needs to be done before running the RFC setup. */
      loc_switchToHfXtalOsc();
      return true;
    }
  }
  return false;
#endif
}


static void Rtos_callback(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
    if (e & RF_EventRxOk)
    {
      rx_call_back(IRQ_RX_OK );
    }
    else if (e & RF_EventRxNOk)
	{
      rx_call_back(IRQ_RX_NOK );
    }
    else if (e & RF_EventInternalError)
    {
      rx_call_back(IRQ_INTERNAL_ERROR);
    }
    else if (e & (RF_EventRxBufFull | RF_EventRxIgnored | RF_EventRxAborted))
   {
      rx_call_back(IRQ_RX_BUF_FULL);
   }
}

