hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/sf_rf_6lowpan.c
static void rx_call_back(uint32_t l_flag)
{
  if(IRQ_RX_OK == (l_flag & IRQ_RX_OK))
  {
      if (cc1310.tx.Tx_waiting_Ack)
      {
          cc1310.rx.p_lastPkt = (uint8_t*)(&cc1310.rx.p_currentDataEntry->data) ;
          if ((cc1310.rx.p_lastPkt[PHY_HEADER_LEN] == 0x02) &&
                  (cc1310.rx.p_lastPkt[PHY_HEADER_LEN + 2] == cc1310.tx.expSeqNo))
          {
              cc1310.tx.Ack_received=1;
          }
          else
          {
              cc1310.tx.Ack_received=0;
          }
          cc1310.rx.p_currentDataEntry->status=DATA_ENTRY_PENDING;
      }
      else
      {
        /* handle the received packet */
        sf_rf_switchState(RF_STATUS_RX);
        /* signal complete reception interrupt */
        RF_SEM_POST(NETSTK_RF_EVENT);
      }
      /* set RX mode again */
      sf_rf_switchState(RF_STATUS_RX_LISTEN);
      bsp_led( HAL_LED1, EN_BSP_LED_OP_OFF );
      bsp_led( HAL_LED0, EN_BSP_LED_OP_ON );
      bsp_led( HAL_LED3, EN_BSP_LED_OP_BLINK );
  }
  else if(IRQ_RX_NOK == (l_flag & IRQ_RX_NOK))
  {
    /* set RX mode again */
    sf_rf_switchState(RF_STATUS_RX_LISTEN);
    bsp_led( HAL_LED1, EN_BSP_LED_OP_ON );
    bsp_led( HAL_LED0, EN_BSP_LED_OP_OFF );
    bsp_led( HAL_LED3, EN_BSP_LED_OP_BLINK );
  }
  else if(IRQ_INTERNAL_ERROR == (l_flag & IRQ_INTERNAL_ERROR))
  {
      /* Initialize the driver again */
      if(sf_rf_switchState(RF_STATUS_INIT) != ROUTINE_DONE )
          sf_rf_switchState(RF_STATUS_ERROR);
      /* Send RX command to the radio */
      if(sf_rf_switchState(RF_STATUS_RX_LISTEN)!= ROUTINE_DONE)
          sf_rf_switchState(RF_STATUS_ERROR);
    bsp_led( HAL_LED1, EN_BSP_LED_OP_ON );
    bsp_led( HAL_LED0, EN_BSP_LED_OP_ON );
  }
  else if((IRQ_RX_BUF_FULL == (l_flag & IRQ_RX_BUF_FULL)) || (IRQ_RX_IGNORED == (l_flag & IRQ_RX_IGNORED))
          || (IRQ_RX_ABORTED == (l_flag & IRQ_RX_ABORTED)) )
  {
    /* set RX mode again */
    sf_rf_switchState(RF_STATUS_RX_LISTEN);
    bsp_led( HAL_LED1, EN_BSP_LED_OP_ON );
    bsp_led( HAL_LED0, EN_BSP_LED_OP_ON );
  }
}




static uint8_t sf_rf_switchState(e_rf_status_t state)
{
#if USE_TI_RTOS
	RF_EventMask result ;
#else
  /* Return value of lib functions */
  static rfc_returnValue_t returnValue;
  /* State of the receiver */
  static rfc_cmdStatus_t cmdStatus;
#endif
  volatile uint16_t i = 0x00U;
  e_nsErr_t err;


  /* check wheter we have to update the state or not */
  if(state!=RF_STATUS_NONE)
    cc1310.state=state;

  switch(cc1310.state)
  {
  case RF_STATUS_INIT :
    if(rf_driver_init())
    {
      /* initiate command pointer */
      cc1310.conf.ps_cmdPropRadioDivSetup=(rfc_radioOp_t*)&RF_802_15_4_cmdPropRadioDivSetup;
      cc1310.conf.ps_cmdFs=(rfc_radioOp_t*)&RF_802_15_4_cmdFs;
      cc1310.rx.p_cmdPropRxAdv=&RF_802_15_4_cmdPropRxAdv;
      cc1310.tx.p_cmdPropTxAdv=&RF_802_15_4_cmdPropTxAdv;

      /*initiate CCA command */
      sf_rf_set_numOfRssiMeas(CC13xx_NUM_OFF_RSSI_CHECKS_DEFAULT);
      sf_rf_init_cca_cmd();

#if USE_TI_RTOS
      /* Set the frequency */
      gps_rf_cmdHandle = RF_postCmd(gps_rfHandle, (RF_Op*)cc1310.conf.ps_cmdFs, RF_PriorityNormal, NULL, 0);
      if(gps_rf_cmdHandle < 0 )
       {
          bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
          return ROUTINE_ERROR_FS_CMD ;
       }
#else
      /* disable  interrupt  */
      RFC_registerCpe0Isr(NULL);
      RFC_registerCpe1Isr(NULL);
      RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));

      /* enable radio again */
      if (RFC_enableRadio() != RFC_OK)
      {
        bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
        return ROUTINE_ERROR_ENABLE_RADIO;
      }

      returnValue = RFC_setupRadio(cc1310.conf.ps_cmdPropRadioDivSetup);
      if(returnValue == RFC_OK)
      {
        /* Send CMD_FS command to RF Core */
        for(i; i<0x7FFF;i++);
        cmdStatus = RFC_sendRadioOp(cc1310.conf.ps_cmdFs);
        if(cmdStatus != RFC_CMDSTATUS_DONE)
        {
          bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
          return ROUTINE_ERROR_FS_CMD ;
        }
      }
      else
          return ROUTINE_ERROR_SETUP_RADIO;

      /* Initialize interrupts */
      RFC_registerCpe0Isr(rx_call_back);
      RFC_enableCpe0Interrupt(IRQ_RX_OK);
      RFC_enableCpe0Interrupt(IRQ_RX_NOK);
      RFC_enableCpe0Interrupt(IRQ_RX_ABORTED);
      RFC_enableCpe0Interrupt(IRQ_INTERNAL_ERROR);
      RFC_enableCpe0Interrupt(IRQ_RX_BUF_FULL);
      RFC_enableCpe0Interrupt(IRQ_RX_IGNORED);

#endif

      /* initialize RX queue */
      if(RFQueue_defineQueue(&cc1310.rx.dataQueue, RxBuff, RX_BUFF_SIZE , 2 , 150 + 3 ) != 0x00U)
      {
        /* Failed to allocate space for all data entries */
        bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
        return ROUTINE_ERROR_INIT_QUEUE ;
      }

      /* reset the waiting for ACK flag */
      cc1310.tx.Tx_waiting_Ack=0;
      /* Initialize global variable. Set the lowest RSSI value as default -255dBm */
      cc1310.rx.c_rssiValue=0xFFU;
      /* set the default TX power */
      cc1310.tx.signalStrength=RF_DEFAULT_TX_POWER;
      return ROUTINE_DONE ;
    }
    else
    {
      bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
      return ROUTINE_ERROR_INIT_RF ;
    }
  case RF_STATUS_IDLE :
    break;
  case RF_STATUS_SLEEP :
#if USE_TI_RTOS
	  return ROUTINE_DONE;
#else
      /* disable  interrupt  */
      RFC_registerCpe0Isr(NULL);

      /* Disable radio core */
      if (RFC_disableRadio() != RFC_OK)
      {
          return ROUTINE_ERROR_DISABLE_RADIO;
      }
      return ROUTINE_DONE;
#endif
  case RF_STATUS_TX :
      /* find out if ACK is required */
      cc1310.tx.Tx_waiting_Ack = packetbuf_attr(PACKETBUF_ATTR_MAC_ACK);
      if(cc1310.tx.Tx_waiting_Ack)
      {
      cc1310.tx.Ack_received=0;
      cc1310.tx.expSeqNo = packetbuf_attr(PACKETBUF_ATTR_MAC_SEQNO);

      /* Get the ACK wait from buffer */
      cc1310.tx.waitForAckTimeout = (uint16_t) packetbuf_attr(PACKETBUF_ATTR_MAC_ACK_WAIT_DURATION);
      }
#if USE_TI_RTOS
      /* TODO to fix this */
      cc1310.tx.Tx_waiting_Ack=0;

      /* Stop last cmd (usually it is Rx cmd ) */
      RF_cancelCmd(gps_rfHandle, gps_rf_cmdHandle, 1);
      /* Send tx command  */
      result = RF_runCmd(gps_rfHandle, (RF_Op*)cc1310.tx.p_cmdPropTxAdv, RF_PriorityNormal, NULL, 0);
      if (!(result & RF_EventLastCmdDone))
      {
        return ROUTINE_ERROR_TX_CMD;
      }
      return ROUTINE_DONE;
#else
      /* Stop last cmd (usually it is Rx cmd ) */
      RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));
      /* Send tx command  */
      cmdStatus = RFC_sendRadioOp((rfc_radioOp_t*)cc1310.tx.p_cmdPropTxAdv);

      /* Since we sent a blocking cmd then we check the state */
      if(cmdStatus != RFC_CMDSTATUS_DONE)
      {
        bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
        return ROUTINE_ERROR_TX_CMD ;
      }
      else
      {
          /* if the packet doesn't require ACK then we finish with success once the packet is send */
          if(cc1310.tx.Tx_waiting_Ack==0)
              return ROUTINE_DONE ;
          /* Send CMD_PROP_RX command to RF Core */
          RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));
          cc1310.rx.p_currentDataEntry=(rfc_dataEntryGeneral_t*)cc1310.rx.dataQueue.pCurrEntry;
          cc1310.rx.p_currentDataEntry->status=DATA_ENTRY_PENDING;
          /* Send Rx command to receive the ACK */
          cmdStatus=RFC_sendRadioOp_nb((rfc_radioOp_t*)cc1310.rx.p_cmdPropRxAdv , NULL);
          /* FIXME wait for ACK */
          //bsp_delay_us(cc1310.tx.waitForAckTimeout);
          for(i; i<0x2FFD;i++); // 3 ms
          /* stop waiting for ACK */
          cc1310.tx.Tx_waiting_Ack=0;
          if(cc1310.tx.Ack_received)
              return ROUTINE_DONE;
          else
              return ROUTINE_ERROR_TX_NOACK;
      }
#endif
  case RF_STATUS_RX_LISTEN :
    cc1310.rx.p_currentDataEntry=(rfc_dataEntryGeneral_t*)cc1310.rx.dataQueue.pCurrEntry;
    /* Set the Data Entity queue for received data */
    cc1310.rx.p_cmdPropRxAdv->pQueue = &cc1310.rx.dataQueue;
    /* Set rx statistics output struct */
    cc1310.rx.p_cmdPropRxAdv->pOutput= (uint8_t*)&cc1310.rx.rxStatistics;

#if USE_TI_RTOS
    /* Stop last cmd (usually it is Rx cmd ) */
    RF_cancelCmd(gps_rfHandle, gps_rf_cmdHandle, 1);
    /* Post CMD_PROP_RX command to RF Core (non-blocking function )*/
    gps_rf_cmdHandle = RF_postCmd(gps_rfHandle, (RF_Op*)cc1310.rx.p_cmdPropRxAdv, RF_PriorityNormal, &Rtos_callback, RF_RTOS_EVENT_MASK);
    /*  check the return value */
    if(gps_rf_cmdHandle < 0 )
    {
      bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
      return ROUTINE_ERROR_RX_CMD ;
    }
    return ROUTINE_DONE ;
#else
    /* Stop last command */
    RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));
    /* Send CMD_PROP_RX command to RF Core */
    cmdStatus=RFC_sendRadioOp_nb((rfc_radioOp_t*)cc1310.rx.p_cmdPropRxAdv , NULL);
    if(cmdStatus != RFC_CMDSTATUS_DONE)
    {
      bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
      return ROUTINE_ERROR_RX_CMD ;
    }
    return ROUTINE_DONE ;
#endif

  case RF_STATUS_RX :

    /* when we receive data */
    cc1310.rx.LenLastPkt = *(uint8_t*)(&cc1310.rx.p_currentDataEntry->data) + 1;
    cc1310.rx.p_lastPkt = (uint8_t*)(&cc1310.rx.p_currentDataEntry->data) ;
    /* parse the received packet to check whether it requires ACK or not */
    framer802154ll_parse(&frame, cc1310.rx.p_lastPkt , cc1310.rx.LenLastPkt );

   if(frame.is_ack_required)
   {
    /* create the ACK  */
    ack_length=framer802154ll_createAck(&frame,ack, sizeof(ack));
    /* configure ACK length and ptr */
    cc1310.tx.p_cmdPropTxAdv->pktLen = ack_length-2  ;
    cc1310.tx.p_cmdPropTxAdv->pPkt = ack;
#if USE_TI_RTOS




#else
    /* Send Tx command to send the ACK */
    RFC_sendRadioOp_nb((rfc_radioOp_t*)cc1310.tx.p_cmdPropTxAdv,NULL);
    /* wait for the command until finish */
    uint16_t wdog = 0xFFFF;
    while(cc1310.tx.p_cmdPropTxAdv->status != PROP_DONE_OK && wdog)
    {
      wdog--;
    }

#endif
    }
   /* Get RSSI value from the queue : The RSSI is given on signed form in dBm.
    * If no RSSI is available, this is signaled with a special value of the RSSI (-128, or 0x80) */
   cc1310.rx.c_rssiValue=(uint8_t) cc1310.rx.p_lastPkt[cc1310.rx.LenLastPkt];
   /* switch to the next entry */
   RFQueue_nextEntry();
   /* Get the current entry and it to pending state */
   cc1310.rx.p_currentDataEntry = (rfc_dataEntryGeneral_t*)RFQueue_getDataEntry();
   cc1310.rx.p_currentDataEntry->status=DATA_ENTRY_PENDING;
    return ROUTINE_DONE ;

  case RF_STATUS_CCA :

#if USE_TI_RTOS
	  return ROUTINE_CCA_RESULT_IDLE;
#else
    /* Stop last cmd (usually it is Rx cmd ) */
    RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));
    /* update command */
    cc1310.cca.s_cmdCS.numRssiBusy =cc1310.cca.c_numOfRssiMeas;
    cc1310.cca.s_cmdCS.numRssiIdle =cc1310.cca.c_numOfRssiMeas;
    /* Start carrier sense */
    cmdStatus = RFC_sendRadioOp((rfc_radioOp_t*)&cc1310.cca.s_cmdCS);
    /* Check if the command was processed correctly */
    if(cmdStatus == RFC_CMDSTATUS_DONE)
    {
      /* Check the status of the CS command */
      if(cc1310.cca.s_cmdCS.status == PROP_DONE_IDLE)
      {
        return ROUTINE_CCA_RESULT_IDLE;
      }
      else
        return ROUTINE_CCA_RESULT_BUSY;
    }
    return ROUTINE_CCA_ERROR_STATE;
#endif

  case RF_STATUS_ERROR :
      /* Call emb6 error handler */
      err = NETSTK_ERR_FATAL;
      emb6_errorHandler(&err);
      return ROUTINE_FATAL_ERROR;
  };
  return ROUTINE_DONE ;
}

